Revit 2024 API
PathOfTravel.PathMidpoint Property
 The midpoint of the path. The Z coordinate will equal the view's level elevation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public XYZ PathMidpoint { get; }
Visual Basic
Public ReadOnly Property PathMidpoint As XYZ
	Get
Visual C++
public:
property XYZ^ PathMidpoint {
	XYZ^ get ();
}
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace